/***********************************************************************
* @file           Motor.c
* @author         ZhaoYun(ZFSZDZ)
* @date           2024.12.24
* @Version        V1.0.0
* @description    电机运行控制应用模块
***********************************************************************/
#include "../Include/Motor.h"

/***********************************************************************
* 函数名称  : MotorInit
* 功能描述  ：电机运行模块初始化函数
* 形参      ：无
* 返回值    ：无
* 要点备注  ：无
***********************************************************************/
void MotorInit(void)
{
    tMotor.Direction = DEFAULT_DIR; 
}
/***********************************************************************
* 函数名称  : MotorApp
* 功能描述  ：电机运行模块应用程序
* 形参      ：无
* 返回值    ：无
* 要点备注  ：无
***********************************************************************/
void MotorApp(void)
{
    MotorRunStopControl();
}
/***********************************************************************
* 函数名称  : MotorRunStopControl
* 功能描述  ：电机运行停止控制
* 形参      ：无
* 返回值    ：无
* 要点备注  ：无
***********************************************************************/
static void MotorRunStopControl(void)
{
    if(tMotor.RunStopState == 0) //在停止状态下
    {
        if(tAdc.SetDuty > 80) //满足旋钮值大于80状态机开始状态
        {
            tBldc.State = 1; //状态机状态更新
            tMotor.RunStopState = 1; //运行停止标志位更新
        }
    }
    else
    {
        if(tAdc.SetDuty < 50) //满足旋钮值小于50,状态机跳转到停止状态
        {
            tBldc.State = 0; //停止状态
            tMotor.RunStopState = 0; //运行停止标志位清0
        }
    }
}
/*******************Copyright (c) ZFSZDZ ******END OF FILE************/
